import random

def task_5_open_lootbox(items: dict[str, int]) -> str:
    """
    Функция, которая имитирует открытие "лутбокса" (контейнера с наградами в играх).
    Функция должна возвращать один предмет с учётом его "веса" или шанса выпадения.

    Args:
        items (dict[str, int]): Словарь, где ключ (str) — название предмета, а значение (int) — его вес.
                                Чем больше вес, тем выше шанс выпадения.

    Returns:
        str: Строка с названием одного выпавшего предмета.
    """
    pass